---
type: VertexPositionColored
namespace: Autodesk.Revit.DB.DirectContext3D
version: 2024
members: 5
tags: [revit-api, class]
---

# VertexPositionColored

`Autodesk.Revit.DB.DirectContext3D.VertexPositionColored` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | VertexPositionColored | 2017 | `public VertexPositionColored ( XYZ position , ColorWithTransparency color )` |
| Method | GetColor | 2017 | `public ColorWithTransparency GetColor ()` |
| Method | GetSizeInFloats | 2017 | `public static int GetSizeInFloats ()` |
| Method | SetColor | 2017 | `public void SetColor ( ColorWithTransparency color )` |
| Property | Position | 2017 | `public XYZ Position { get ; set ; }` |